Assignments/hw4.org
#+title: Assignment 4
#+HTML_MATHJAX: align: left indent: 2em
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../myStyle.css" />
#+OPTIONS: html-style:nil H:2 toc:2 todo:nil author:nil date:nil
#+HTML_LINK_HOME: ../index.html
The following assignment is due *Thursday 8/02 by 8:00 PM*.  You'll
need to submit a ~.zip~ file containing a Cargo project named ~hw4~ in
Gradescope. You can get the setup with:
#+begin_src
cargo new hw4
#+end_src
You can put your solutions into the file ~hw4/src/main.rs~.  Please
make sure to run ~cargo clean~ before submitting, i.e., don't sumbit
a ~target~ directory or a ~.git~ directory.

The theme of this assignment is "hacking the trait system."  Not all
patterns here are canonically "Rustian" (and in some cases may be
considered antipatterns) but they'll require us to get creative with
traits.

I've included some unit tests throughout the assignment. Rust makes it
/very/ easy to write simple unit tests, see the section in RPL on [[https://doc.rust-lang.org/stable/book/ch11-01-writing-tests.html][how
to write tests]] for more information.[fn::The ideas in this assignment
come from a smattering of blog posts and crates, it's unclear to me
which ones at the point.]

