Assignments/hw4.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-26 Fri 12:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Assignment 4</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../myStyle.css" />

</head>
<body>
<div id="org-div-home-and-up"><a href="../../material.html">↩</a></div><div id="content" class="content">
<h1 class="title">Assignment 4</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf2cc0b6">1. Monoids</a></li>
<li><a href="#org78bac01">2. Functors</a></li>
<li><a href="#org9e21011">3. Applicatives</a></li>
</ul>
</div>
</div>
<p>
The following assignment is due <b>Thursday 8/02 by 8:00 PM</b>.  You'll
need to submit a <code>.zip</code> file containing a Cargo project named <code>hw4</code> in
Gradescope. You can get the setup with:
</p>
<div class="org-src-container">
<pre class="src src-nil">cargo new hw4
</pre>
</div>
<p>
You can put your solutions into the file <code>hw4/src/main.rs</code>.  Please
make sure to run <code>cargo clean</code> before submitting, i.e., don't sumbit
a <code>target</code> directory or a <code>.git</code> directory.
</p>

<p>
The theme of this assignment is "hacking the trait system."  Not all
patterns here are canonically "Rustian" (and in some cases may be
considered antipatterns) but they'll require us to get creative with
traits.
</p>

<p>
I've included some unit tests throughout the assignment. Rust makes it
<i>very</i> easy to write simple unit tests, see the section in RPL on <a href="https://doc.rust-lang.org/stable/book/ch11-01-writing-tests.html">how
to write tests</a> for more information.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>
