Assignments/hw4.org
* Monoids
Many data types have algebraic structure that can be captured by a
shared interface.  This is a common programming pattern in Haskell,
and makes appearances in the Rust standard library.

All algebraic structures we'll consider in this problem deal with a
binary operators. We'll abstract out this operator as part of a
generic trait:

#+begin_src rust
trait BinOp<T> {
    fn op(lhs: T, rhs: T) -> T;
}
#+end_src

A *semigroup* is a set $X$ together with a binary operation $\circ : X
\to X \to X$ which is associative.

It's possible to define a concatenation operation (~mconcat~) for any
semigroup, which takes a starting value and an iterator, and folds the
operator over the values of the iterator:

#+begin_src rust
  trait Semigroup<O> where
      O: BinOp<Self>,
      Self: Sized
  {
      fn mconcat<I: Iterator<Item=Self>>(start: Self, iter: I) -> Self {
	  let mut out = start;
	  for item in iter {
	      out = O::op(out, item)
	  }
	  out
      }
  }
#+end_src

This trait is generic over operators of a given type.  For technical
reasons, we also require types on which we define semigroups are ~Sized~.

A *monoid* is a set $X$ and an associative binary operator $\circ : X
\to X \to X$ and a designated unit element $u \in X$.

The tasks for this problem:

+ Define a monoid trait in analogy with the ~Semigroup~ trait, and so
  that ~Semigroup~ is a supertrait.
+ Implement these traits for ~i32~ and ~String~ so that the tests
  below pass.

Part of this problem is reverse engineering (e.g., what kind of thing
should ~Add~ be?)  I would recommend looking over section on [[https://doc.rust-lang.org/stable/book/ch19-03-advanced-traits.html][Advanced
Traits]] in RPL for some hints.  Note that one of the upshots of this
pattern is that we can have multiple algebraic traits for a given type
with different operators, and we can have a uniform convention for
referring to kinds of operators across types.

#+begin_src rust
  #[cfg(test)]
  mod monoid_tests {
      use super::*;

      #[test]
      fn mconcat_semi_add_i32() {
	  let actual = <i32 as Semigroup<Add>>::mconcat(10, vec![1, 2, 3, 4, 5].into_iter());
	  assert_eq!(25, actual)
      }

      #[test]
      fn mconcat_semi_mul_i32() {
	  let actual = <i32 as Semigroup<Mul>>::mconcat(10, vec![1, 2, 3, 4, 5].into_iter());
	  assert_eq!(1200, actual)
      }

      #[test]
      fn mconcat_mon_add_i32() {
	  let actual = <i32 as Monoid<Add>>::mconcat(vec![1, 2, 3, 4, 5].into_iter());
	  assert_eq!(15, actual)
      }

      #[test]
      fn mconcat_mon_mul_i32() {
	  let actual = <i32 as Monoid<Mul>>::mconcat(vec![1, 2, 3, 4, 5].into_iter());
	  assert_eq!(120, actual)
      }

      #[test]
      fn mconcat_semi_str() {
	  let s1 = String::from("abc");
	  let s2 = String::from("def");
	  let s3 = String::from("ghi");
	  let expected = String::from("abcdefghi");
	  let actual = <String as Semigroup<Add>>::mconcat(s1, vec![s2, s3].into_iter());
	  assert_eq!(expected, actual);
      }

      #[test]
      fn mconcat_mon_str() {
	  let s1 = String::from("abc");
	  let s2 = String::from("def");
	  let s3 = String::from("ghi");
	  let expected = String::from("abcdefghi");
	  let actual = <String as Monoid<Add>>::mconcat(vec![s1, s2, s3].into_iter());
	  assert_eq!(expected, actual)
      }
  }
#+end_src

In addition implement, a function ~count_units~ which takes as input
an iterator over values from a Monoid and returns a count of the
number of unit elements.  The challenge here will be correctly
defining the trait bounds.

Your implementation should pass the following tests; note the
~::<...>~ syntax.

#+begin_src rust
  #[cfg(test)]
  mod count_unit_tests {
      use super::*;

      #[test]
      fn count_units_add_i32() {
          let expected = 3;
          let actual = count_units::<Add, _, _>(vec![1, 0, 1, 0, 0, 5, -1].into_iter());
          assert_eq!(expected, actual);
      }

      #[test]
      fn count_units_mul_i32() {
          let expected = 2;
          let actual = count_units::<Mul, _, _>(vec![1, 0, 1, 0, 0, 5, -1].into_iter());
          assert_eq!(expected, actual);
      }
  }
#+end_src

