Assignments/hw4.html
<div id="outline-container-orgf2cc0b6" class="outline-2">
<h2 id="orgf2cc0b6"><span class="section-number-2">1.</span> Monoids</h2>
<div class="outline-text-2" id="text-1">
<p>
Many data types have algebraic structure that can be captured by a
shared interface.  This is a common programming pattern in Haskell,
and makes appearances in the Rust standard library.
</p>

<p>
All algebraic structures we'll consider in this problem deal with a
binary operators. We'll abstract out this operator as part of a
generic trait:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">trait</span> <span style="color: #228b22;">BinOp</span>&lt;<span style="color: #228b22;">T</span>&gt; {
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">op</span>(<span style="color: #a0522d;">lhs</span>: <span style="color: #228b22;">T</span>, <span style="color: #a0522d;">rhs</span>: <span style="color: #228b22;">T</span>) -&gt; <span style="color: #228b22;">T</span>;
}
</pre>
</div>

<p>
A <b>semigroup</b> is a set \(X\) together with a binary operation \(\circ : X
\to X \to X\) which is associative.
</p>

<p>
It's possible to define a concatenation operation (<code>mconcat</code>) for any
semigroup, which takes a starting value and an iterator, and folds the
operator over the values of the iterator:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">trait</span> <span style="color: #228b22;">Semigroup</span>&lt;<span style="color: #228b22;">O</span>&gt; <span style="color: #a020f0;">where</span>
    <span style="color: #a0522d;">O</span>: <span style="color: #228b22;">BinOp</span>&lt;<span style="color: #228b22;">Self</span>&gt;,
    <span style="color: #a0522d;">Self</span>: <span style="color: #228b22;">Sized</span>
{
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">mconcat</span>&lt;<span style="color: #a0522d;">I</span>: <span style="color: #228b22;">Iterator</span>&lt;Item=Self&gt;&gt;(<span style="color: #a0522d;">start</span>: <span style="color: #228b22;">Self</span>, <span style="color: #a0522d;">iter</span>: <span style="color: #228b22;">I</span>) -&gt; <span style="color: #228b22;">Self</span> {
        <span style="color: #a020f0;">let</span> <span style="color: #a020f0;">mut</span> <span style="color: #a0522d;">out</span> = start;
        <span style="color: #a020f0;">for</span> <span style="color: #a0522d;">item</span> <span style="color: #a020f0;">in</span> iter {
            out = <span style="color: #228b22;">O</span>::op(out, item)
        }
        out
    }
}
</pre>
</div>

<p>
This trait is generic over operators of a given type.  For technical
reasons, we also require types on which we define semigroups are <code>Sized</code>.
</p>

<p>
A <b>monoid</b> is a set \(X\) and an associative binary operator \(\circ : X
\to X \to X\) and a designated unit element \(u \in X\).
</p>

<p>
The tasks for this problem:
</p>

<ul class="org-ul">
<li>Define a monoid trait in analogy with the <code>Semigroup</code> trait, and so
that <code>Semigroup</code> is a supertrait.</li>
<li>Implement these traits for <code>i32</code> and <code>String</code> so that the tests
below pass.</li>
</ul>

<p>
Part of this problem is reverse engineering (e.g., what kind of thing
should <code>Add</code> be?)  I would recommend looking over section on <a href="https://doc.rust-lang.org/stable/book/ch19-03-advanced-traits.html">Advanced
Traits</a> in RPL for some hints.  Note that one of the upshots of this
pattern is that we can have multiple algebraic traits for a given type
with different operators, and we can have a uniform convention for
referring to kinds of operators across types.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #483d8b;">#[cfg(test)]</span>
<span style="color: #a020f0;">mod</span> <span style="color: #008b8b;">monoid_tests</span> {
    <span style="color: #a020f0;">use</span> <span style="color: #a020f0;">super</span>::*;

    <span style="color: #483d8b;">#[test]</span>
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">mconcat_semi_add_i32</span>() {
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">actual</span> = &lt;<span style="color: #228b22;">i32</span> <span style="color: #a020f0;">as</span> <span style="color: #228b22;">Semigroup</span>&lt;<span style="color: #228b22;">Add</span>&gt;&gt;::mconcat(10, <span style="color: #483d8b;">vec!</span>[1, 2, 3, 4, 5].into_iter());
        <span style="color: #483d8b;">assert_eq!</span>(25, actual)
    }

    <span style="color: #483d8b;">#[test]</span>
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">mconcat_semi_mul_i32</span>() {
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">actual</span> = &lt;<span style="color: #228b22;">i32</span> <span style="color: #a020f0;">as</span> <span style="color: #228b22;">Semigroup</span>&lt;<span style="color: #228b22;">Mul</span>&gt;&gt;::mconcat(10, <span style="color: #483d8b;">vec!</span>[1, 2, 3, 4, 5].into_iter());
        <span style="color: #483d8b;">assert_eq!</span>(1200, actual)
    }

    <span style="color: #483d8b;">#[test]</span>
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">mconcat_mon_add_i32</span>() {
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">actual</span> = &lt;<span style="color: #228b22;">i32</span> <span style="color: #a020f0;">as</span> <span style="color: #228b22;">Monoid</span>&lt;<span style="color: #228b22;">Add</span>&gt;&gt;::mconcat(<span style="color: #483d8b;">vec!</span>[1, 2, 3, 4, 5].into_iter());
        <span style="color: #483d8b;">assert_eq!</span>(15, actual)
    }

    <span style="color: #483d8b;">#[test]</span>
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">mconcat_mon_mul_i32</span>() {
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">actual</span> = &lt;<span style="color: #228b22;">i32</span> <span style="color: #a020f0;">as</span> <span style="color: #228b22;">Monoid</span>&lt;<span style="color: #228b22;">Mul</span>&gt;&gt;::mconcat(<span style="color: #483d8b;">vec!</span>[1, 2, 3, 4, 5].into_iter());
        <span style="color: #483d8b;">assert_eq!</span>(120, actual)
    }

    <span style="color: #483d8b;">#[test]</span>
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">mconcat_semi_str</span>() {
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">s1</span> = <span style="color: #228b22;">String</span>::from(<span style="color: #8b2252;">"abc"</span>);
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">s2</span> = <span style="color: #228b22;">String</span>::from(<span style="color: #8b2252;">"def"</span>);
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">s3</span> = <span style="color: #228b22;">String</span>::from(<span style="color: #8b2252;">"ghi"</span>);
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">expected</span> = <span style="color: #228b22;">String</span>::from(<span style="color: #8b2252;">"abcdefghi"</span>);
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">actual</span> = &lt;<span style="color: #228b22;">String</span> <span style="color: #a020f0;">as</span> <span style="color: #228b22;">Semigroup</span>&lt;<span style="color: #228b22;">Add</span>&gt;&gt;::mconcat(s1, <span style="color: #483d8b;">vec!</span>[s2, s3].into_iter());
        <span style="color: #483d8b;">assert_eq!</span>(expected, actual);
    }

    <span style="color: #483d8b;">#[test]</span>
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">mconcat_mon_str</span>() {
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">s1</span> = <span style="color: #228b22;">String</span>::from(<span style="color: #8b2252;">"abc"</span>);
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">s2</span> = <span style="color: #228b22;">String</span>::from(<span style="color: #8b2252;">"def"</span>);
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">s3</span> = <span style="color: #228b22;">String</span>::from(<span style="color: #8b2252;">"ghi"</span>);
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">expected</span> = <span style="color: #228b22;">String</span>::from(<span style="color: #8b2252;">"abcdefghi"</span>);
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">actual</span> = &lt;<span style="color: #228b22;">String</span> <span style="color: #a020f0;">as</span> <span style="color: #228b22;">Monoid</span>&lt;<span style="color: #228b22;">Add</span>&gt;&gt;::mconcat(<span style="color: #483d8b;">vec!</span>[s1, s2, s3].into_iter());
        <span style="color: #483d8b;">assert_eq!</span>(expected, actual)
    }
}
</pre>
</div>

<p>
In addition implement, a function <code>count_units</code> which takes as input
an iterator over values from a Monoid and returns a count of the
number of unit elements.  The challenge here will be correctly
defining the trait bounds.
</p>

<p>
Your implementation should pass the following tests; note the
<code>::&lt;...&gt;</code> syntax.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #483d8b;">#[cfg(test)]</span>
<span style="color: #a020f0;">mod</span> <span style="color: #008b8b;">count_unit_tests</span> {
    <span style="color: #a020f0;">use</span> <span style="color: #a020f0;">super</span>::*;

    <span style="color: #483d8b;">#[test]</span>
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">count_units_add_i32</span>() {
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">expected</span> = 3;
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">actual</span> = count_units::&lt;<span style="color: #228b22;">Add</span>, _, _&gt;(<span style="color: #483d8b;">vec!</span>[1, 0, 1, 0, 0, 5, -1].into_iter());
        <span style="color: #483d8b;">assert_eq!</span>(expected, actual);
    }

    <span style="color: #483d8b;">#[test]</span>
    <span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">count_units_mul_i32</span>() {
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">expected</span> = 2;
        <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">actual</span> = count_units::&lt;<span style="color: #228b22;">Mul</span>, _, _&gt;(<span style="color: #483d8b;">vec!</span>[1, 0, 1, 0, 0, 5, -1].into_iter());
        <span style="color: #483d8b;">assert_eq!</span>(expected, actual);
    }
}
</pre>
</div>
</div>
</div>
