Assignments/hw4.org
* Applicatives

Things can get a lot more complicated once we start generalizing past
functors.

An *applicative functor* is a functor together with a function ~pure~
that can "convert a thing into a held thing" and ~app~ which can
"apply a held function to a held thing." This gives us the following trait:

#+begin_src rust
  trait Applicative: Functor {
      fn pure(x: Self::Inner) -> Self;
      fn app<T, U>(self, ax: Self::Outer<T>) -> Self::Outer<U> where
	  T: Clone,
	  Self::Inner: Fn(T) -> U;
  }
#+end_src

Again, there's some weird stuff going on with the types.  We have a
trait bound which requires the inner type of ~Self~ to be a closure,
so that ~self~ is a "thing holding a function" and the input is a
"thing holding a ~T~" written with the ~Outer~ associated type.

*The task for this problem:* Implement the ~Applicative~ trait for
~Option~, in analogy with the implementation of ~Functor~.

+ The ~pure~ function should take a value and wrap it in a ~Some~ constructor.
+ The ~app~ function should apply the held function to the held value
  if both are not ~None~.


Finally, give a default implementation of a method ~app2~ which can be
applied when the inner value is a /Curried/ binary closure, and which
"runs" ~app~ twice.  Getting the trait bounds right for ~app2~ is a
bit messy, let the compiler guide you...


Your implementation should pass the following tests:

#+begin_src rust

  #[cfg(test)]
  mod app_tests {
      use super::*;

      #[test]
      fn option_pure() {
          assert_eq!(Some(vec![1, 2, 3]), Option::pure(vec![1, 2, 3]));
      }

      #[test]
      fn option_app() {
          let mut f = Some(|x| x + 1);
          assert_eq!(Some(11), f.app(Some(10)));
          assert_eq!(None, f.app(None));
          f = None;
          assert_eq!(None, f.app(Some(10)));
          assert_eq!(None, f.app(None));
      }

      #[test]
      fn option_app2() {
          let f = Some(|x| move |y| x + y);
          assert_eq!(Some(7), f.app2(Some(3), Some(4)));
          assert_eq!(None, f.app2(Some(3), None));
          assert_eq!(None, f.app2(None, Some(3)));
          assert_eq!(None, f.app2(None, None));
      }
  }
#+end_src
